Revit 2027 API
FabricationConfiguration.GetAncillaryName Method
 Gets the fabrication ancillary name for the specified fabrication ancillary identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAncillaryName(
	int ancillaryId
)
Public Function GetAncillaryName (
	ancillaryId As Integer
) As String
public:
String^ GetAncillaryName(
	int ancillaryId
)
member GetAncillaryName :
        ancillaryId : int -> string
Parameters
ancillaryId Int32
 The fabrication ancillary database identifier of the ancillary.
Return Value
String
 The name of the ancillary.
Exceptions
Exception | Condition
ArgumentException |  The ancillary does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace